Revit 2026 API

# FamilyUtils Methods

---

The FamilyUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConvertFamilyToFaceHostBased | Converts a family to be face host based. |
|  | FamilyCanConvertToFaceHostBased | Indicates whether the family can be converted to face host based. |
|  | GetProfileSymbols | Gets the profile Family Symbols of the document. |

#### Reference

FamilyUtils Class

Autodesk.Revit.DB Namespace